In [2]:
%pip install Faker
%pip install names-dataset

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: Faker in /home/shirin/.local/lib/python3.10/site-packages (14.2.0)
Requirement already satisfied: python-dateutil>=2.4 in /home/shirin/.local/lib/python3.10/site-packages (from Faker) (2.8.2)
Requirement already satisfied: six>=1.5 in /usr/lib/python3/dist-packages (from python-dateutil>=2.4->Faker) (1.16.0)
Note: you may need to restart the kernel to use updated packages.
Defaulting to user installation because normal site-packages is not writeable
Collecting names-dataset
  Downloading names-dataset-3.1.0.tar.gz (58.4 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 58.4/58.4 MB 23.3 MB/s eta 0:00:00m eta 0:00:01[36m0:00:01
  Preparing metadata (setup.py) ... done
Collecting pycountry
  Downloading pycountry-22.3.5.tar.gz (10.1 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 10.1/10.1 MB 27.7 MB/s eta 0:00:001m29.9 MB/s eta 0:00:01
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Preparing metadata (pyproject.toml) ... done
Requirement already satisfied: setuptools in /usr/lib/python3/dist-packages (from pycountry->names-dataset) (59.6.0)
Building wheels for collected packages: names-dataset, pycountry
  Building wheel for names-dataset (setup.py) ... done
  Created wheel for names-dataset: filename=names_dataset-3.1.0-py3-none-any.whl size=116832781 sha256=556ae0b5e1263d2bd4890d8aebf494ca1cd037c1adb814e12db6309072876d08
  Stored in directory: /home/shirin/.cache/pip/wheels/cf/f8/43/0c4aba87b34e971e7255a41f11dc0035c5e55b026dc3480986
  Building wheel for pycountry (pyproject.toml) ... done
  Created wheel for pycountry: filename=pycountry-22.3.5-py2.py3-none-any.whl size=10681845 sha256=2858c073ee12160a690a4310fb5df20155e918b4100076cd779070c7b6e55ea1
  Stored in directory: /home/shirin/.cache/pip/wheels/03/57/cc/290c5252ec97a6d78d36479a3c5e5ecc76318afcb241ad9dbe
Successfully built names-dataset pycountry
Installing collected packages: pycountry, names-dataset
Successfully installed names-dataset-3.1.0 pycountry-22.3.5
Note: you may need to restart the kernel to use updated packages.

# EDA
(Explotary Data Analysis)

In [10]:
import faker
from faker import Faker #Faker is a class, so ya need to build obj from it 
from names_dataset import NameDataset

In [15]:
import numpy as np
import pandas as pd

In [11]:
#Step 1: Build fake farsi + english names
en_names = Faker()
fa_names = Faker('fa')
nd = NameDataset() #obj from NameDataset class that imported

In [12]:
nd.search('shirin')

{'first_name': {'country': {'Bangladesh': 0.184,
   'Canada': 0.059,
   'Germany': 0.07,
   'Egypt': 0.042,
   'United Kingdom': 0.046,
   'Iraq': 0.084,
   'Iran, Islamic Republic of': 0.284,
   'Saudi Arabia': 0.04,
   'Turkey': 0.044,
   'United States': 0.148},
  'gender': {'Female': 0.948, 'Male': 0.052},
  'rank': {'Bangladesh': 407,
   'Canada': 936,
   'Germany': 1226,
   'Egypt': 8726,
   'United Kingdom': 2487,
   'Iraq': 3207,
   'Iran, Islamic Republic of': 269,
   'Saudi Arabia': 10287,
   'Turkey': 3564,
   'United States': 3419}},
 'last_name': {'country': {'United Arab Emirates': 0.056,
   'Bangladesh': 0.415,
   'Germany': 0.058,
   'Israel': 0.054,
   'Iraq': 0.055,
   'Iran, Islamic Republic of': 0.141,
   'Russian Federation': 0.051,
   'Saudi Arabia': 0.075,
   'Turkey': 0.043,
   'United States': 0.051},
  'gender': {},
  'rank': {'United Arab Emirates': 10112,
   'Bangladesh': 1164,
   'Germany': 14879,
   'Israel': 10724,
   'Iran, Islamic Republic of': 3096,
   'Iraq': None,
   'Russian Federation': None,
   'Saudi Arabia': None,
   'Turkey': None,
   'United States': None}}}

In [28]:
#function to make random fake names, 50% of time persian/ half english
def make_name():
    if np.random.rand() < 0.5:
        return en_names.name()
    return fa_names.name()

In [31]:
[make_name() for _ in range(10)]

['Sarah Griffin',
 'اميرمهدي زمانی',
 'Philip Gutierrez',
 'Frank Walker',
 'Heather Hardin',
 'Ashley Macdonald',
 'محدثه منصوری',
 'آیناز اکبر پور',
 'احسان منصوری',
 'محمد جعفر پور']

In [34]:
df = pd.DataFrame({
    "Name": [make_name() for _ in range(100)]
})

In [35]:
df.head()

                        Name
0            Charles Sanchez
1  جناب آقای محمدياسين ربانی
2                 اسرا زمانی
3                 ستايش حسنی
4            Margaret Finley

# Extract First and Last name

In [45]:
#seperate first n last names from our generated names
full_name = en_names.name()
full_name

'Peggy Green'

In [46]:
first_name, *_, last_name = full_name.split() #apply this on the colum Name our df

In [50]:
def get_firstnlast_name(name):
    first_name, *_, last_name = full_name.split()
    return first_name, last_name

In [72]:
df["First Name"]= df['Name'].apply(
    lambda full_name: full_name.split()[0] #0 mish ro be onvane name gerefteh
)
df["LastName"]  = df['Name'].apply(
    lambda full_name: full_name.split()[-1].upper() #last elemnt as family name
)

In [73]:
df

                         Name First Name LastName  Gender
0             Charles Sanchez    Charles  SANCHEZ  Female
1   جناب آقای محمدياسين ربانی       جناب    ربانی  Female
2                  اسرا زمانی       اسرا    زمانی  Female
3                  ستايش حسنی      ستايش     حسنی  Female
4             Margaret Finley   Margaret   FINLEY  Female
..                        ...        ...      ...     ...
95              Cynthia Chang    Cynthia    CHANG  Female
96                 یوسف معروف       یوسف    معروف  Female
97                 رضا لاهوتی        رضا   لاهوتی  Female
98               Brenda Lloyd     Brenda    LLOYD  Female
99  سرکار خانم دکتر اسما زارع      سرکار     زارع  Female

[100 rows x 4 columns]

# Gender Predictor

In [62]:
nd.search('shirin')['first_name'].keys()

dict_keys(['country', 'gender', 'rank'])

In [63]:
nd.search('shirin')['first_name']['gender']

{'Female': 0.948, 'Male': 0.052}

In [74]:
#how to get the value for a given name key with maximum val (look at shirin above)
def name_to_gender(name):
    info = nd.search(first_name)['first_name']
    if info is None:
        return 

    return max(info['gender'], key= info['gender'].get)

In [75]:
name_to_gender('shirin')

'Female'

In [76]:
df['Gender'] = df['First Name'].apply(name_to_gender)

In [71]:
df

                         Name First Name LastName  Gender
0             Charles Sanchez    Charles  Sanchez  Female
1   جناب آقای محمدياسين ربانی       جناب    ربانی  Female
2                  اسرا زمانی       اسرا    زمانی  Female
3                  ستايش حسنی      ستايش     حسنی  Female
4             Margaret Finley   Margaret   Finley  Female
..                        ...        ...      ...     ...
95              Cynthia Chang    Cynthia    Chang  Female
96                 یوسف معروف       یوسف    معروف  Female
97                 رضا لاهوتی        رضا   لاهوتی  Female
98               Brenda Lloyd     Brenda    Lloyd  Female
99  سرکار خانم دکتر اسما زارع      سرکار     زارع  Female

[100 rows x 4 columns]